"""
輸入每月網內、網外、市話、通話時間(sec)及網內、網外 簡訊則數，求最佳資費。
費率如下表：
*月租費也要納入考量
資費類型 183型 383型 983型
月租費 183元 383元 983元
優惠內容 月租費可抵等額通信費
語音 網內 0.08 0.07 0.06
(元/秒) 網外 0.1393 0.1304 0.1087
市話(元/秒) 0.1349 0.1217 0.1018
簡訊 網內 1.1287 1.1127 0.9572
(元/則) 網外 1.4803 1.2458 1.1243

輸入 網內語音(sec)、網外語音(sec)、市話(sec)、網內簡訊數、網外簡訊數 測試資料。
Sample Input：
100
100
100
100
100

Sample Output：
183型
"""
def rate(a,b,c,d,e,f):
    total = a*x + b*y + c*z + d*q + e*r
    if total <= f:
        return f
    else:
        return total

x=int(input())
y=int(input())
z=int(input())
q=int(input())
r=int(input())

num183=rate(0.08,0.1393,0.1349,1.1287,1.4803,183)
num383=rate(0.07,0.1304,0.1217,1.1127,1.2458,383)
num983=rate(0.06,0.1087,0.1018,0.9572,1.1243,983)

i=[num183,num383,num983]
t=sorted(i)     #sorted是照順序排列

if t[0] < 383:
    print('183型')
elif t[1] < 983:
    print('383型')
else:
    print('983型')