"""
蘋果、奇異果、鳳梨，三種水果價格及折扣表如下，且老闆為了回饋社會，決定再加碼，購買總顆數(三種水果加起來)達30顆，總金額再打8.7折。
今一顧客欲購買，蘋果:ｘ顆、 奇異果:ｙ顆、鳳梨:ｚ顆（n1、n2、n3 為使用者輸入），
請計算本次購買需花費多少錢？
-------------------------------------------------------------------
------------| 定價 | 1~10顆 | 11~15顆 | 16~20顆 | 21顆~ |
-------------------------------------------------------------------
| 蘋果-----| 30---| 原價----| 9.5折-----| 9折-------| 8折----|
-------------------------------------------------------------------
| 奇異果--| 70---| 原價----| 9折-------| 8.5折-----| 7.5折-|
-------------------------------------------------------------------
| 鳳梨-----| 40---| 原價----| 8.5折-----| 8折-------| 8折---|
-------------------------------------------------------------------
Sample Input：
10
10
10

Sample Output：
1218
"""
def getdis(x,diss):
    dis=0
    if x>=21:
        dis=diss[0]
    elif x>=16:
        dis=diss[1]
    elif x>=11:
        dis=diss[2]
    elif x>=1:
        dis=diss[3]
    else:
        dis=diss[4]
    return dis

x=int(input())
y=int(input())
z=int(input())

A_diss=[0.8,0.9,0.95,1,0]
B_diss=[0.75,0.85,0.9,1,0]
C_diss=[0.8,0.8,0.85,1,0]
"""
A_diss=[8,9,9.5,1,0]
B_diss=[7.5,8.5,9,1,0]
C_diss=[8,8,8.5,1,0]
"""
A_dis=getdis(x,A_diss)
B_dis=getdis(y,B_diss)
C_dis=getdis(z,C_diss)

cost=x*30*A_dis+y*70*B_dis+z*40*C_dis

if x+y+z>=30:
    newcost=cost*0.87
else:
    newcost=cost
    
print(int(newcost))